{
  "name": "Lani Akita",
  "miniBio": ["I create modern web apps & digital experiences."],
  "sectionOne": {
    "title": "About Me",
    "content": [
      "Aloha! My name is Lani Akita, and I’m a Full Stack Developer from Honolulu, Hawaii. While the Web Industry (& the world) has changed dramatically in my 10+ years of building websites, my endless curiosity still drives me to learn, experiment, and to build newer, better, more ambitious and more accessible things.",
      "You can follow my socials for the latest updates, and or you can read the blog to come with me as I dive into the details of working with bleeding edge web technologies."
    ],
    "contentAlt": [
      "Aloha! My name is Lani Akita, and I’m a Full Stack Developer from Honolulu, Hawaii.",
      "While the Web Industry (& the world) has changed dramatically in my 10+ years of building websites, my endless curiosity still drives me to learn, experiment, and to build newer, better, more ambitious and more accessible things.",
      "Today, I mostly write TypeScript in either React or Svelte, paired with a framework like Next.Js or SvelteKit. When working with databases I use a TypeScript ORM like drizzle. For styles I use TailwindCSS. For WebGL, I mostly work with Three.Js and a component library such as react-three/fiber or threlte.",
      "You can follow my socials for the latest updates, and or you can read the blog to come with me as I dive into the details of working with bleeding edge web technologies.",
      "PS: You can also visit the Gallery to view some of my Art, some of which is for sale on Etsy. ^-^"
    ],
    "codeBlock": "{\n  \"id\": \"UID000000808\",\n  \"name\": \"Lani Akita\",\n  \"ocupation\": \"Full Stack Developer\",\n  \"languagesSpoken\": [\n    \"English\",\n    \"French\"\n  ],\n  \"education\": [\n    {\n      \"degree\": \"Biology BSc\",\n      \"focus\": \"Neuroscience\",\n      \"school\": \"University of California, Santa Barbara\",\n      \"location\": \"Santa Barbara, CA.\",\n      \"timeframe\": \"Sep 2016 to Dec 2020\"\n    }\n  ],\n}"
  },
  "sectionThree": {
    "title": "Build Process",
    "content": [
      "Today, I tend to create the UI/UX in figma, use affinity designer for branding, then diagram the Architecture in Excalidraw, before I lock myself into a Neovim buffer to write TypeScript in either Svelte or React (with their respective compatible Full-Stack Frameworks: SvelteKit or Next.Js) and use a TypeScript ORM like drizzle, when I need to access a database directly. For WebGL, I'm partial to Three.Js and its respective component libraries (threlte or react-three) for both performance and ability for rapid development.",
      "For both development & production, I tend to deploy such apps as a serverless function that provides either a Node.js or Bun runtime environment. That's also hooked into a GitHub action to create a CI/CD pipeline, so things redeploy when a branch gets a fresh commit.",
      "For non-serverless apps, I've recently been exploring kOps as a better way to deploy a Kubernetes cluster on Cloud Infra to host containerized apps (databases, caching databases, CMSes, etc.) and using something like Flux CD to actually deploy and manage the apps on the provisioned cluster.",
      "For everything that can't (or shouldn't) be shoved into a container (like a VPC), I'm partial to writing it out as an OpenTofu config (Opensource Terraform) just because IaC and declarative config files makes my brain happy. Which is the same reason I prefer NixOS to Ansible, which I'll use if I need to provision a custom environment on multiple EC2 instances, for example.",
      "Finally, for when I'm away from my text editor and command line, I step into the role as Artist and paint on a graphics tablet in Krita. You can find some of my work on the Gallery page, Patreon, and also for sale on Etsy."
    ],
    "codeBlock": "{\n  \"favoriteProgrammingTools\": {\n    \"languages\": [ \"TypeScript\", \"JavaScript\", \"Golang\" ],\n    \"orm\": \"drizzle\",\n    \"libraries\": [ \"Svelte\", \"React\", \"Three.js\" ],\n    \"componentLibraries\": [\n      \"tailwindcss\",\n      \"threlte\",\n      \"react-three/fiber\",\n      \"react-three/drei\"\n    ],\n    \"frameworks\": [ \"SvelteKit\", \"Next.Js\", \"Remix\" ],\n    \"operatingSystem\": \"NixOS\",\n    \"textEditor\": \"Neovim\",\n    \"techBooks\": [\n      {\n        \"title\": \"You Don't Know JS\",\n        \"authors\": [\"Kyle Simpson\"]\n      },\n      {\n        \"title\": \"The Book of Shaders\",\n        \"authors\": [\n          \"Patricio Gonzalez Vivo\",\n          \"Jen Lowe\"\n        ]\n      }\n    ]\n  }\n}"
  }
}
